In [82]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [83]:
#index_col and skiprows are args that are passable for pd.read

sp500 = pd.read_excel('sp_500_crashes.xlsx', index_col=0, skiprows=1)

# Fix: Select columns correctly and handle missing values
cols_to_fix = ['Adj Close', 'Close', 'High', 'Low', 'Open']
sp500[cols_to_fix] = sp500[cols_to_fix].fillna(0).astype(int)

sp500.head()

            Adj Close  Close  High   Low  Open      Volume
Date
2007-07-02       1519   1519  1519  1504  1504  2648990000
2007-07-03       1524   1524  1526  1519  1519  1560790000
2007-07-05       1525   1525  1526  1517  1524  2622950000
2007-07-06       1530   1530  1532  1520  1524  2441520000
2007-07-09       1531   1531  1534  1527  1530  2715330000

In [84]:
# More defensive data conversion method
# wonâ€™t break if one column is missing
# Great for inconsistent or unpredictable data sources

# cols_to_fix = ['Adj Close', 'Close', 'High', 'Low', 'Open']
# for col in cols_to_fix:
#     if col in sp500.columns:
#         sp500[col] = sp500[col].fillna(0).astype(int)

In [85]:
sp500.info()
sp500.describe()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1513 entries, 2007-07-02 to 2020-07-31
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Adj Close  1513 non-null   int64
 1   Close      1513 non-null   int64
 2   High       1513 non-null   int64
 3   Low        1513 non-null   int64
 4   Open       1513 non-null   int64
 5   Volume     1513 non-null   int64
dtypes: int64(6)
memory usage: 82.7 KB

,Adj Close,Close,High,Low,Open,Volume
count,1513.000000,1513.000000,1513.000000,1513.000000,1513.000000,1.513000e+03
mean,1520.731659,1520.731659,1532.274950,1507.842036,1520.805684,4.555045e+09
std,703.452562,703.452562,706.392707,699.681544,703.381929,1.373284e+09
min,676.000000,676.000000,695.000000,666.000000,679.000000,1.025000e+09
25%,1123.000000,1123.000000,1139.000000,1116.000000,1125.000000,3.676890e+09
50%,1313.000000,1313.000000,1321.000000,1305.000000,1314.000000,4.258140e+09
75%,1450.000000,1450.000000,1461.000000,1439.000000,1451.000000,5.250660e+09
max,3386.000000,3386.000000,3393.000000,3378.000000,3380.000000,1.145623e+10

In [86]:
# this is an inbuilt seaborn dataset
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [87]:
# efficiently calculate and insert a new column 'tip_pct'
tips.insert(
    tips.columns.get_loc('tip') + 1,  # position: right after 'tip'
    'tip_pct',                         # new column name
    (tips['tip'] / tips['total_bill']).round(2)  # computed values
)

tips.head()

   total_bill   tip  tip_pct     sex smoker  day    time  size
0       16.99  1.01     0.06  Female     No  Sun  Dinner     2
1       10.34  1.66     0.16    Male     No  Sun  Dinner     3
2       21.01  3.50     0.17    Male     No  Sun  Dinner     3
3       23.68  3.31     0.14    Male     No  Sun  Dinner     2
4       24.59  3.61     0.15  Female     No  Sun  Dinner     4

In [88]:
# use inplace=True here to remove the 'tip_pct' column
# applies the operation directly to this DataFrame instead of returning a copy
# eg tips = tips.drop('tip_pct', axis='columns')  

tips.drop('tip_pct', axis = 'columns', inplace = True)
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [89]:
flights = sns.load_dataset('flights')
# Convert 'year' column to datetime format, setting day and month as January 1st by default
flights['year'] = pd.to_datetime(flights['year'], format='%Y')
flights.tail()

          year month  passengers
139 1960-01-01   Aug         606
140 1960-01-01   Sep         508
141 1960-01-01   Oct         461
142 1960-01-01   Nov         390
143 1960-01-01   Dec         432

In [90]:
passengers_year = flights.groupby('year', as_index = False)['passengers'].sum()
passengers_year = passengers_year.sort_values(by='passengers', ascending=False)
passengers_year.head()

         year  passengers
11 1960-01-01        5714
10 1959-01-01        5140
9  1958-01-01        4572
8  1957-01-01        4421
7  1956-01-01        3939